Revit 2024 API
BuiltInFailures.SketchFailures.CurveFromPickedFailed Property
 Can't create boundary from pick.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CurveFromPickedFailed { get; }
Visual Basic
Public Shared ReadOnly Property CurveFromPickedFailed As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CurveFromPickedFailed {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace